Applied:

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # grafana_api_key.terraform[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "grafana_api_key" "terraform" {
      [32m+[0m [0m[1m[0mcloud_stack_slug[0m[0m = "ishanjaterraformdemo"
      [32m+[0m [0m[1m[0mexpiration[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m              = (sensitive value)
      [32m+[0m [0m[1m[0mname[0m[0m             = "terraform"
      [32m+[0m [0m[1m[0mrole[0m[0m             = "Admin"
    }

[1m  # grafana_cloud_stack.ishanterraformde[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "grafana_cloud_stack" "ishanterraformde" {
      [32m+[0m [0m[1m[0malertmanager_name[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0malertmanager_status[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0malertmanager_url[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0malertmanager_user_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mlogs_name[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mlogs_status[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mlogs_url[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mlogs_user_id[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                             = "ishanjaterraformdemo"
      [32m+[0m [0m[1m[0morg_id[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0morg_name[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0morg_slug[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mprometheus_name[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mprometheus_remote_endpoint[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mprometheus_remote_write_endpoint[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprometheus_status[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mprometheus_url[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mprometheus_user_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mregion_slug[0m[0m                      = "us"
      [32m+[0m [0m[1m[0mslug[0m[0m                             = "ishanjaterraformdemo"
      [32m+[0m [0m[1m[0mstatus[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0murl[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mwait_for_readiness[0m[0m               = true
    }

[1m  # grafana_dashboard.influxdb["new-dashboard.json"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "grafana_dashboard" "influxdb" {
      [32m+[0m [0m[1m[0mconfig_json[0m[0m  = jsonencode(
            {
              [32m+[0m [0mannotations          = {
                  [32m+[0m [0mlist = [
                      [32m+[0m [0m{
                          [32m+[0m [0mbuiltIn    = 1
                          [32m+[0m [0mdatasource = {
                              [32m+[0m [0mtype = "datasource"
                              [32m+[0m [0muid  = "grafana"
                            }
                          [32m+[0m [0menable     = true
                          [32m+[0m [0mhide       = true
                          [32m+[0m [0miconColor  = "rgba(0, 211, 255, 1)"
                          [32m+[0m [0mname       = "Annotations & Alerts"
                          [32m+[0m [0mtarget     = {
                              [32m+[0m [0mlimit    = 100
                              [32m+[0m [0mmatchAny = false
                              [32m+[0m [0mtags     = []
                              [32m+[0m [0mtype     = "dashboard"
                            }
                          [32m+[0m [0mtype       = "dashboard"
                        },
                    ]
                }
              [32m+[0m [0mdescription          = "Visualize Amazon EC2 metrics"
              [32m+[0m [0meditable             = true
              [32m+[0m [0mfiscalYearStartMonth = 0
              [32m+[0m [0mgraphTooltip         = 0
              [32m+[0m [0miteration            = 1655908908223
              [32m+[0m [0mlinks                = []
              [32m+[0m [0mliveNow              = false
              [32m+[0m [0mpanels               = [
                  [32m+[0m [0m{
                      [32m+[0m [0mcollapsed  = false
                      [32m+[0m [0mdatasource = {
                          [32m+[0m [0muid = "$datasource"
                        }
                      [32m+[0m [0mgridPos    = {
                          [32m+[0m [0mh = 1
                          [32m+[0m [0mw = 24
                          [32m+[0m [0mx = 0
                          [32m+[0m [0my = 0
                        }
                      [32m+[0m [0mpanels     = []
                      [32m+[0m [0mtitle      = "Overview"
                      [32m+[0m [0mtype       = "row"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0maliasColors     = {}
                      [32m+[0m [0mbars            = false
                      [32m+[0m [0mdashLength      = 10
                      [32m+[0m [0mdashes          = false
                      [32m+[0m [0mdatasource      = {
                          [32m+[0m [0muid = "$datasource"
                        }
                      [32m+[0m [0mfieldConfig     = {
                          [32m+[0m [0mdefaults  = {
                              [32m+[0m [0mlinks = []
                            }
                          [32m+[0m [0moverrides = []
                        }
                      [32m+[0m [0mfill            = 1
                      [32m+[0m [0mfillGradient    = 0
                      [32m+[0m [0mgridPos         = {
                          [32m+[0m [0mh = 8
                          [32m+[0m [0mw = 24
                          [32m+[0m [0mx = 0
                          [32m+[0m [0my = 1
                        }
                      [32m+[0m [0mhiddenSeries    = false
                      [32m+[0m [0mlegend          = {
                          [32m+[0m [0malignAsTable = true
                          [32m+[0m [0mavg          = true
                          [32m+[0m [0mcurrent      = false
                          [32m+[0m [0mmax          = false
                          [32m+[0m [0mmin          = false
                          [32m+[0m [0mrightSide    = true
                          [32m+[0m [0mshow         = true
                          [32m+[0m [0msort         = "avg"
                          [32m+[0m [0msortDesc     = true
                          [32m+[0m [0mtotal        = false
                          [32m+[0m [0mvalues       = true
                        }
                      [32m+[0m [0mlines           = true
                      [32m+[0m [0mlinewidth       = 1
                      [32m+[0m [0mnullPointMode   = "connected"
                      [32m+[0m [0moptions         = {
                          [32m+[0m [0malertThreshold = true
                        }
                      [32m+[0m [0mpercentage      = false
                      [32m+[0m [0mpluginVersion   = "9.0.1-b253e87pre"
                      [32m+[0m [0mpointradius     = 2
                      [32m+[0m [0mpoints          = false
                      [32m+[0m [0mrenderer        = "flot"
                      [32m+[0m [0mseriesOverrides = []
                      [32m+[0m [0mspaceLength     = 10
                      [32m+[0m [0mstack           = false
                      [32m+[0m [0msteppedLine     = false
                      [32m+[0m [0mtargets         = [
                          [32m+[0m [0m{
                              [32m+[0m [0malias            = ""
                              [32m+[0m [0mdimensions       = {
                                  [32m+[0m [0mInstanceId = "*"
                                }
                              [32m+[0m [0mexpression       = ""
                              [32m+[0m [0mid               = ""
                              [32m+[0m [0mmatchExact       = true
                              [32m+[0m [0mmetricEditorMode = 0
                              [32m+[0m [0mmetricName       = "CPUUtilization"
                              [32m+[0m [0mmetricQueryType  = 0
                              [32m+[0m [0mnamespace        = "AWS/EC2"
                              [32m+[0m [0mperiod           = "$period"
                              [32m+[0m [0mrefId            = "B"
                              [32m+[0m [0mregion           = "$region"
                              [32m+[0m [0mstatistic        = "Maximum"
                            },
                        ]
                      [32m+[0m [0mthresholds      = []
                      [32m+[0m [0mtimeRegions     = []
                      [32m+[0m [0mtitle           = "CPU utilization per instance [max %]"
                      [32m+[0m [0mtooltip         = {
                          [32m+[0m [0mshared     = true
                          [32m+[0m [0msort       = 0
                          [32m+[0m [0mvalue_type = "individual"
                        }
                      [32m+[0m [0mtype            = "graph"
                      [32m+[0m [0mxaxis           = {
                          [32m+[0m [0mmode   = "time"
                          [32m+[0m [0mshow   = true
                          [32m+[0m [0mvalues = []
                        }
                      [32m+[0m [0myaxes           = [
                          [32m+[0m [0m{
                              [32m+[0m [0mformat  = "percent"
                              [32m+[0m [0mlabel   = ""
                              [32m+[0m [0mlogBase = 1
                              [32m+[0m [0mmax     = "100"
                              [32m+[0m [0mmin     = "0"
                              [32m+[0m [0mshow    = true
                            },
                          [32m+[0m [0m{
                              [32m+[0m [0mformat  = "short"
                              [32m+[0m [0mlogBase = 1
                              [32m+[0m [0mshow    = true
                            },
                        ]
                      [32m+[0m [0myaxis           = {
                          [32m+[0m [0malign = false
                        }
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0maliasColors     = {}
                      [32m+[0m [0mbars            = false
                      [32m+[0m [0mdashLength      = 10
                      [32m+[0m [0mdashes          = false
                      [32m+[0m [0mdatasource      = {
                          [32m+[0m [0muid = "$datasource"
                        }
                      [32m+[0m [0mfieldConfig     = {
                          [32m+[0m [0mdefaults  = {
                              [32m+[0m [0mlinks = []
                            }
                          [32m+[0m [0moverrides = []
                        }
                      [32m+[0m [0mfill            = 1
                      [32m+[0m [0mfillGradient    = 0
                      [32m+[0m [0mgridPos         = {
                          [32m+[0m [0mh = 9
                          [32m+[0m [0mw = 24
                          [32m+[0m [0mx = 0
                          [32m+[0m [0my = 9
                        }
                      [32m+[0m [0mhiddenSeries    = false
                      [32m+[0m [0mlegend          = {
                          [32m+[0m [0malignAsTable = false
                          [32m+[0m [0mavg          = false
                          [32m+[0m [0mcurrent      = false
                          [32m+[0m [0mmax          = false
                          [32m+[0m [0mmin          = false
                          [32m+[0m [0mshow         = false
                          [32m+[0m [0mtotal        = false
                          [32m+[0m [0mvalues       = false
                        }
                      [32m+[0m [0mlines           = true
                      [32m+[0m [0mlinewidth       = 1
                      [32m+[0m [0mnullPointMode   = "connected"
                      [32m+[0m [0moptions         = {
                          [32m+[0m [0malertThreshold = true
                        }
                      [32m+[0m [0mpercentage      = false
                      [32m+[0m [0mpluginVersion   = "9.0.1-b253e87pre"
                      [32m+[0m [0mpointradius     = 2
                      [32m+[0m [0mpoints          = false
                      [32m+[0m [0mrenderer        = "flot"
                      [32m+[0m [0mseriesOverrides = [
                          [32m+[0m [0m{
                              [32m+[0m [0malias     = "Inbound"
                              [32m+[0m [0mtransform = "negative-Y"
                            },
                        ]
                      [32m+[0m [0mspaceLength     = 10
                      [32m+[0m [0mstack           = false
                      [32m+[0m [0msteppedLine     = false
                      [32m+[0m [0mtargets         = [
                          [32m+[0m [0m{
                              [32m+[0m [0malias            = "Inbound"
                              [32m+[0m [0mdimensions       = {
                                  [32m+[0m [0mInstanceId = "*"
                                }
                              [32m+[0m [0mexpression       = "SUM(REMOVE_EMPTY(SEARCH('{AWS/EC2,InstanceId} MetricName=\"NetworkIn\"', 'Sum', $period)))/$period"
                              [32m+[0m [0mid               = ""
                              [32m+[0m [0mmatchExact       = true
                              [32m+[0m [0mmetricEditorMode = 1
                              [32m+[0m [0mmetricName       = "NetworkOut"
                              [32m+[0m [0mmetricQueryType  = 0
                              [32m+[0m [0mnamespace        = "AWS/EC2"
                              [32m+[0m [0mperiod           = "$period"
                              [32m+[0m [0mrefId            = "B"
                              [32m+[0m [0mregion           = "$region"
                              [32m+[0m [0mstatistic        = "Average"
                            },
                          [32m+[0m [0m{
                              [32m+[0m [0malias            = "Outbound"
                              [32m+[0m [0mdimensions       = {
                                  [32m+[0m [0mInstanceId = "*"
                                }
                              [32m+[0m [0mexpression       = "SUM(REMOVE_EMPTY(SEARCH('{AWS/EC2,InstanceId} MetricName=\"NetworkOut\"', 'Sum', $period)))/$period"
                              [32m+[0m [0mid               = ""
                              [32m+[0m [0mmatchExact       = true
                              [32m+[0m [0mmetricEditorMode = 1
                              [32m+[0m [0mmetricName       = "NetworkOut"
                              [32m+[0m [0mmetricQueryType  = 0
                              [32m+[0m [0mnamespace        = "AWS/EC2"
                              [32m+[0m [0mperiod           = "$period"
                              [32m+[0m [0mrefId            = "C"
                              [32m+[0m [0mregion           = "$region"
                              [32m+[0m [0mstatistic        = "Average"
                            },
                        ]
                      [32m+[0m [0mthresholds      = []
                      [32m+[0m [0mtimeRegions     = []
                      [32m+[0m [0mtitle           = "Total network traffic outbound (+) and inbound (-) [bytes/sec]"
                      [32m+[0m [0mtooltip         = {
                          [32m+[0m [0mshared     = true
                          [32m+[0m [0msort       = 0
                          [32m+[0m [0mvalue_type = "individual"
                        }
                      [32m+[0m [0mtype            = "graph"
                      [32m+[0m [0mxaxis           = {
                          [32m+[0m [0mmode   = "time"
                          [32m+[0m [0mshow   = true
                          [32m+[0m [0mvalues = []
                        }
                      [32m+[0m [0myaxes           = [
                          [32m+[0m [0m{
                              [32m+[0m [0mformat  = "short"
                              [32m+[0m [0mlogBase = 1
                              [32m+[0m [0mshow    = true
                            },
                          [32m+[0m [0m{
                              [32m+[0m [0mformat  = "short"
                              [32m+[0m [0mlogBase = 1
                              [32m+[0m [0mmin     = "0"
                              [32m+[0m [0mshow    = true
                            },
                        ]
                      [32m+[0m [0myaxis           = {
                          [32m+[0m [0malign = false
                        }
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mcollapsed  = true
                      [32m+[0m [0mdatasource = {
                          [32m+[0m [0muid = "$datasource"
                        }
                      [32m+[0m [0mgridPos    = {
                          [32m+[0m [0mh = 1
                          [32m+[0m [0mw = 24
                          [32m+[0m [0mx = 0
                          [32m+[0m [0my = 18
                        }
                      [32m+[0m [0mpanels     = [
                          [32m+[0m [0m{
                              [32m+[0m [0maliasColors     = {}
                              [32m+[0m [0mbars            = false
                              [32m+[0m [0mdashLength      = 10
                              [32m+[0m [0mdashes          = false
                              [32m+[0m [0mdatasource      = {
                                  [32m+[0m [0muid = "$datasource"
                                }
                              [32m+[0m [0mfill            = 1
                              [32m+[0m [0mfillGradient    = 0
                              [32m+[0m [0mgridPos         = {
                                  [32m+[0m [0mh = 9
                                  [32m+[0m [0mw = 12
                                  [32m+[0m [0mx = 0
                                  [32m+[0m [0my = 19
                                }
                              [32m+[0m [0mhiddenSeries    = false
                              [32m+[0m [0mid              = 17
                              [32m+[0m [0mlegend          = {
                                  [32m+[0m [0malignAsTable = false
                                  [32m+[0m [0mavg          = false
                                  [32m+[0m [0mcurrent      = false
                                  [32m+[0m [0mmax          = false
                                  [32m+[0m [0mmin          = false
                                  [32m+[0m [0mrightSide    = true
                                  [32m+[0m [0mshow         = true
                                  [32m+[0m [0mtotal        = false
                                  [32m+[0m [0mvalues       = false
                                }
                              [32m+[0m [0mlines           = true
                              [32m+[0m [0mlinewidth       = 1
                              [32m+[0m [0mnullPointMode   = "connected"
                              [32m+[0m [0moptions         = {
                                  [32m+[0m [0mdataLinks = []
                                }
                              [32m+[0m [0mpercentage      = false
                              [32m+[0m [0mpointradius     = 2
                              [32m+[0m [0mpoints          = false
                              [32m+[0m [0mrenderer        = "flot"
                              [32m+[0m [0mseriesOverrides = []
                              [32m+[0m [0mspaceLength     = 10
                              [32m+[0m [0mstack           = false
                              [32m+[0m [0msteppedLine     = false
                              [32m+[0m [0mtargets         = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0malias            = ""
                                      [32m+[0m [0mdimensions       = {
                                          [32m+[0m [0mInstanceId = "*"
                                        }
                                      [32m+[0m [0mexpression       = "REMOVE_EMPTY(SEARCH('{AWS/EC2,InstanceId} MetricName=\"NetworkIn\"', 'Sum', $period))/$period"
                                      [32m+[0m [0mid               = ""
                                      [32m+[0m [0mmatchExact       = true
                                      [32m+[0m [0mmetricEditorMode = 1
                                      [32m+[0m [0mmetricName       = "NetworkIn"
                                      [32m+[0m [0mmetricQueryType  = 0
                                      [32m+[0m [0mnamespace        = "AWS/EC2"
                                      [32m+[0m [0mperiod           = "$period"
                                      [32m+[0m [0mrefId            = "A"
                                      [32m+[0m [0mregion           = "$region"
                                      [32m+[0m [0mstatistic        = "Sum"
                                    },
                                ]
                              [32m+[0m [0mthresholds      = []
                              [32m+[0m [0mtimeRegions     = []
                              [32m+[0m [0mtitle           = "Inbound network traffic per instance [bytes/sec]"
                              [32m+[0m [0mtooltip         = {
                                  [32m+[0m [0mshared     = true
                                  [32m+[0m [0msort       = 0
                                  [32m+[0m [0mvalue_type = "individual"
                                }
                              [32m+[0m [0mtype            = "graph"
                              [32m+[0m [0mxaxis           = {
                                  [32m+[0m [0mmode   = "time"
                                  [32m+[0m [0mshow   = true
                                  [32m+[0m [0mvalues = []
                                }
                              [32m+[0m [0myaxes           = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mmin     = "0"
                                      [32m+[0m [0mshow    = true
                                    },
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mshow    = true
                                    },
                                ]
                              [32m+[0m [0myaxis           = {
                                  [32m+[0m [0malign = false
                                }
                            },
                          [32m+[0m [0m{
                              [32m+[0m [0maliasColors     = {}
                              [32m+[0m [0mbars            = false
                              [32m+[0m [0mdashLength      = 10
                              [32m+[0m [0mdashes          = false
                              [32m+[0m [0mdatasource      = {
                                  [32m+[0m [0muid = "$datasource"
                                }
                              [32m+[0m [0mfill            = 1
                              [32m+[0m [0mfillGradient    = 0
                              [32m+[0m [0mgridPos         = {
                                  [32m+[0m [0mh = 9
                                  [32m+[0m [0mw = 12
                                  [32m+[0m [0mx = 12
                                  [32m+[0m [0my = 19
                                }
                              [32m+[0m [0mhiddenSeries    = false
                              [32m+[0m [0mid              = 18
                              [32m+[0m [0mlegend          = {
                                  [32m+[0m [0malignAsTable = false
                                  [32m+[0m [0mavg          = false
                                  [32m+[0m [0mcurrent      = false
                                  [32m+[0m [0mmax          = false
                                  [32m+[0m [0mmin          = false
                                  [32m+[0m [0mrightSide    = true
                                  [32m+[0m [0mshow         = true
                                  [32m+[0m [0mtotal        = false
                                  [32m+[0m [0mvalues       = false
                                }
                              [32m+[0m [0mlines           = true
                              [32m+[0m [0mlinewidth       = 1
                              [32m+[0m [0mnullPointMode   = "connected"
                              [32m+[0m [0moptions         = {
                                  [32m+[0m [0mdataLinks = []
                                }
                              [32m+[0m [0mpercentage      = false
                              [32m+[0m [0mpointradius     = 2
                              [32m+[0m [0mpoints          = false
                              [32m+[0m [0mrenderer        = "flot"
                              [32m+[0m [0mseriesOverrides = []
                              [32m+[0m [0mspaceLength     = 10
                              [32m+[0m [0mstack           = false
                              [32m+[0m [0msteppedLine     = false
                              [32m+[0m [0mtargets         = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0malias            = ""
                                      [32m+[0m [0mdimensions       = {
                                          [32m+[0m [0mInstanceId = "*"
                                        }
                                      [32m+[0m [0mexpression       = "REMOVE_EMPTY(SEARCH('{AWS/EC2,InstanceId} MetricName=\"NetworkOut\"', 'Sum', $period))/$period"
                                      [32m+[0m [0mid               = ""
                                      [32m+[0m [0mmatchExact       = true
                                      [32m+[0m [0mmetricEditorMode = 1
                                      [32m+[0m [0mmetricName       = "NetworkIn"
                                      [32m+[0m [0mmetricQueryType  = 0
                                      [32m+[0m [0mnamespace        = "AWS/EC2"
                                      [32m+[0m [0mperiod           = "$period"
                                      [32m+[0m [0mrefId            = "A"
                                      [32m+[0m [0mregion           = "$region"
                                      [32m+[0m [0mstatistic        = "Sum"
                                    },
                                ]
                              [32m+[0m [0mthresholds      = []
                              [32m+[0m [0mtimeRegions     = []
                              [32m+[0m [0mtitle           = "Outbound network traffic per instance [bytes/sec]"
                              [32m+[0m [0mtooltip         = {
                                  [32m+[0m [0mshared     = true
                                  [32m+[0m [0msort       = 0
                                  [32m+[0m [0mvalue_type = "individual"
                                }
                              [32m+[0m [0mtype            = "graph"
                              [32m+[0m [0mxaxis           = {
                                  [32m+[0m [0mmode   = "time"
                                  [32m+[0m [0mshow   = true
                                  [32m+[0m [0mvalues = []
                                }
                              [32m+[0m [0myaxes           = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mmin     = "0"
                                      [32m+[0m [0mshow    = true
                                    },
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mshow    = true
                                    },
                                ]
                              [32m+[0m [0myaxis           = {
                                  [32m+[0m [0malign = false
                                }
                            },
                          [32m+[0m [0m{
                              [32m+[0m [0maliasColors     = {}
                              [32m+[0m [0mbars            = false
                              [32m+[0m [0mdashLength      = 10
                              [32m+[0m [0mdashes          = false
                              [32m+[0m [0mdatasource      = {
                                  [32m+[0m [0muid = "$datasource"
                                }
                              [32m+[0m [0mfill            = 1
                              [32m+[0m [0mfillGradient    = 0
                              [32m+[0m [0mgridPos         = {
                                  [32m+[0m [0mh = 9
                                  [32m+[0m [0mw = 12
                                  [32m+[0m [0mx = 0
                                  [32m+[0m [0my = 28
                                }
                              [32m+[0m [0mhiddenSeries    = false
                              [32m+[0m [0mid              = 9
                              [32m+[0m [0mlegend          = {
                                  [32m+[0m [0malignAsTable = false
                                  [32m+[0m [0mavg          = false
                                  [32m+[0m [0mcurrent      = false
                                  [32m+[0m [0mmax          = false
                                  [32m+[0m [0mmin          = false
                                  [32m+[0m [0mrightSide    = true
                                  [32m+[0m [0mshow         = true
                                  [32m+[0m [0mtotal        = false
                                  [32m+[0m [0mvalues       = false
                                }
                              [32m+[0m [0mlines           = true
                              [32m+[0m [0mlinewidth       = 1
                              [32m+[0m [0mnullPointMode   = "connected"
                              [32m+[0m [0moptions         = {
                                  [32m+[0m [0mdataLinks = []
                                }
                              [32m+[0m [0mpercentage      = false
                              [32m+[0m [0mpointradius     = 2
                              [32m+[0m [0mpoints          = false
                              [32m+[0m [0mrenderer        = "flot"
                              [32m+[0m [0mseriesOverrides = []
                              [32m+[0m [0mspaceLength     = 10
                              [32m+[0m [0mstack           = false
                              [32m+[0m [0msteppedLine     = false
                              [32m+[0m [0mtargets         = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0malias            = ""
                                      [32m+[0m [0mdimensions       = {
                                          [32m+[0m [0mInstanceId = "*"
                                        }
                                      [32m+[0m [0mexpression       = "REMOVE_EMPTY(SEARCH('{AWS/EC2,InstanceId} MetricName=\"NetworkPacketsIn\"', 'Sum', $period))/$period"
                                      [32m+[0m [0mid               = ""
                                      [32m+[0m [0mmatchExact       = true
                                      [32m+[0m [0mmetricEditorMode = 1
                                      [32m+[0m [0mmetricName       = "NetworkPacketsIn"
                                      [32m+[0m [0mmetricQueryType  = 0
                                      [32m+[0m [0mnamespace        = "AWS/EC2"
                                      [32m+[0m [0mperiod           = "$period"
                                      [32m+[0m [0mrefId            = "A"
                                      [32m+[0m [0mregion           = "$region"
                                      [32m+[0m [0mstatistic        = "Sum"
                                    },
                                ]
                              [32m+[0m [0mthresholds      = []
                              [32m+[0m [0mtimeRegions     = []
                              [32m+[0m [0mtitle           = "Inbound network packets per instance [IOPS]"
                              [32m+[0m [0mtooltip         = {
                                  [32m+[0m [0mshared     = true
                                  [32m+[0m [0msort       = 0
                                  [32m+[0m [0mvalue_type = "individual"
                                }
                              [32m+[0m [0mtype            = "graph"
                              [32m+[0m [0mxaxis           = {
                                  [32m+[0m [0mmode   = "time"
                                  [32m+[0m [0mshow   = true
                                  [32m+[0m [0mvalues = []
                                }
                              [32m+[0m [0myaxes           = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mmin     = "0"
                                      [32m+[0m [0mshow    = true
                                    },
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mshow    = true
                                    },
                                ]
                              [32m+[0m [0myaxis           = {
                                  [32m+[0m [0malign = false
                                }
                            },
                          [32m+[0m [0m{
                              [32m+[0m [0maliasColors     = {}
                              [32m+[0m [0mbars            = false
                              [32m+[0m [0mdashLength      = 10
                              [32m+[0m [0mdashes          = false
                              [32m+[0m [0mdatasource      = {
                                  [32m+[0m [0muid = "$datasource"
                                }
                              [32m+[0m [0mfill            = 1
                              [32m+[0m [0mfillGradient    = 0
                              [32m+[0m [0mgridPos         = {
                                  [32m+[0m [0mh = 9
                                  [32m+[0m [0mw = 12
                                  [32m+[0m [0mx = 12
                                  [32m+[0m [0my = 28
                                }
                              [32m+[0m [0mhiddenSeries    = false
                              [32m+[0m [0mid              = 19
                              [32m+[0m [0mlegend          = {
                                  [32m+[0m [0malignAsTable = false
                                  [32m+[0m [0mavg          = false
                                  [32m+[0m [0mcurrent      = false
                                  [32m+[0m [0mmax          = false
                                  [32m+[0m [0mmin          = false
                                  [32m+[0m [0mrightSide    = true
                                  [32m+[0m [0mshow         = true
                                  [32m+[0m [0mtotal        = false
                                  [32m+[0m [0mvalues       = false
                                }
                              [32m+[0m [0mlines           = true
                              [32m+[0m [0mlinewidth       = 1
                              [32m+[0m [0mnullPointMode   = "connected"
                              [32m+[0m [0moptions         = {
                                  [32m+[0m [0mdataLinks = []
                                }
                              [32m+[0m [0mpercentage      = false
                              [32m+[0m [0mpointradius     = 2
                              [32m+[0m [0mpoints          = false
                              [32m+[0m [0mrenderer        = "flot"
                              [32m+[0m [0mseriesOverrides = []
                              [32m+[0m [0mspaceLength     = 10
                              [32m+[0m [0mstack           = false
                              [32m+[0m [0msteppedLine     = false
                              [32m+[0m [0mtargets         = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0malias            = ""
                                      [32m+[0m [0mdimensions       = {
                                          [32m+[0m [0mInstanceId = "*"
                                        }
                                      [32m+[0m [0mexpression       = "REMOVE_EMPTY(SEARCH('{AWS/EC2,InstanceId} MetricName=\"NetworkPacketsOut\"', 'Sum', $period))/$period"
                                      [32m+[0m [0mid               = ""
                                      [32m+[0m [0mmatchExact       = true
                                      [32m+[0m [0mmetricEditorMode = 1
                                      [32m+[0m [0mmetricName       = "NetworkPacketsIn"
                                      [32m+[0m [0mmetricQueryType  = 0
                                      [32m+[0m [0mnamespace        = "AWS/EC2"
                                      [32m+[0m [0mperiod           = "$period"
                                      [32m+[0m [0mrefId            = "A"
                                      [32m+[0m [0mregion           = "$region"
                                      [32m+[0m [0mstatistic        = "Sum"
                                    },
                                ]
                              [32m+[0m [0mthresholds      = []
                              [32m+[0m [0mtimeRegions     = []
                              [32m+[0m [0mtitle           = "Outbound network packets per instance [IOPS]"
                              [32m+[0m [0mtooltip         = {
                                  [32m+[0m [0mshared     = true
                                  [32m+[0m [0msort       = 0
                                  [32m+[0m [0mvalue_type = "individual"
                                }
                              [32m+[0m [0mtype            = "graph"
                              [32m+[0m [0mxaxis           = {
                                  [32m+[0m [0mmode   = "time"
                                  [32m+[0m [0mshow   = true
                                  [32m+[0m [0mvalues = []
                                }
                              [32m+[0m [0myaxes           = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mmin     = "0"
                                      [32m+[0m [0mshow    = true
                                    },
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mshow    = true
                                    },
                                ]
                              [32m+[0m [0myaxis           = {
                                  [32m+[0m [0malign = false
                                }
                            },
                        ]
                      [32m+[0m [0mtitle      = "Network details"
                      [32m+[0m [0mtype       = "row"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mcollapsed  = true
                      [32m+[0m [0mdatasource = {
                          [32m+[0m [0muid = "$datasource"
                        }
                      [32m+[0m [0mgridPos    = {
                          [32m+[0m [0mh = 1
                          [32m+[0m [0mw = 24
                          [32m+[0m [0mx = 0
                          [32m+[0m [0my = 19
                        }
                      [32m+[0m [0mpanels     = [
                          [32m+[0m [0m{
                              [32m+[0m [0mcontent    = ""
                              [32m+[0m [0mdatasource = {
                                  [32m+[0m [0muid = "$datasource"
                                }
                              [32m+[0m [0mgridPos    = {
                                  [32m+[0m [0mh = 1
                                  [32m+[0m [0mw = 24
                                  [32m+[0m [0mx = 0
                                  [32m+[0m [0my = 38
                                }
                              [32m+[0m [0mid         = 30
                              [32m+[0m [0mmode       = "markdown"
                              [32m+[0m [0moptions    = {}
                              [32m+[0m [0mtitle      = "The following metrics are reported for EC2 Instance Store Volumes. For Amazon EBS volumes, see the EBS dashboard."
                              [32m+[0m [0mtype       = "text"
                            },
                          [32m+[0m [0m{
                              [32m+[0m [0maliasColors     = {}
                              [32m+[0m [0mbars            = false
                              [32m+[0m [0mdashLength      = 10
                              [32m+[0m [0mdashes          = false
                              [32m+[0m [0mdatasource      = {
                                  [32m+[0m [0muid = "$datasource"
                                }
                              [32m+[0m [0mfill            = 1
                              [32m+[0m [0mfillGradient    = 0
                              [32m+[0m [0mgridPos         = {
                                  [32m+[0m [0mh = 9
                                  [32m+[0m [0mw = 12
                                  [32m+[0m [0mx = 0
                                  [32m+[0m [0my = 39
                                }
                              [32m+[0m [0mhiddenSeries    = false
                              [32m+[0m [0mid              = 3
                              [32m+[0m [0mlegend          = {
                                  [32m+[0m [0malignAsTable = false
                                  [32m+[0m [0mavg          = false
                                  [32m+[0m [0mcurrent      = false
                                  [32m+[0m [0mmax          = false
                                  [32m+[0m [0mmin          = false
                                  [32m+[0m [0mrightSide    = true
                                  [32m+[0m [0mshow         = true
                                  [32m+[0m [0mtotal        = false
                                  [32m+[0m [0mvalues       = false
                                }
                              [32m+[0m [0mlines           = true
                              [32m+[0m [0mlinewidth       = 1
                              [32m+[0m [0mnullPointMode   = "null as zero"
                              [32m+[0m [0moptions         = {
                                  [32m+[0m [0mdataLinks = []
                                }
                              [32m+[0m [0mpercentage      = false
                              [32m+[0m [0mpointradius     = 2
                              [32m+[0m [0mpoints          = false
                              [32m+[0m [0mrenderer        = "flot"
                              [32m+[0m [0mseriesOverrides = []
                              [32m+[0m [0mspaceLength     = 10
                              [32m+[0m [0mstack           = false
                              [32m+[0m [0msteppedLine     = true
                              [32m+[0m [0mtargets         = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0malias            = "{{label}}"
                                      [32m+[0m [0mdimensions       = {
                                          [32m+[0m [0mInstanceId = "*"
                                        }
                                      [32m+[0m [0mexpression       = "REMOVE_EMPTY(SEARCH('{AWS/EC2,InstanceId} MetricName=\"DiskReadBytes\"', 'Sum', $period))/$period"
                                      [32m+[0m [0mid               = ""
                                      [32m+[0m [0mmatchExact       = true
                                      [32m+[0m [0mmetricEditorMode = 1
                                      [32m+[0m [0mmetricName       = "DiskReadBytes"
                                      [32m+[0m [0mmetricQueryType  = 0
                                      [32m+[0m [0mnamespace        = "AWS/EC2"
                                      [32m+[0m [0mperiod           = "$period"
                                      [32m+[0m [0mrefId            = "A"
                                      [32m+[0m [0mregion           = "$region"
                                      [32m+[0m [0mstatistic        = "Sum"
                                    },
                                ]
                              [32m+[0m [0mthresholds      = []
                              [32m+[0m [0mtimeRegions     = []
                              [32m+[0m [0mtitle           = "Disk READ per instance [bytes/sec]"
                              [32m+[0m [0mtooltip         = {
                                  [32m+[0m [0mshared     = true
                                  [32m+[0m [0msort       = 0
                                  [32m+[0m [0mvalue_type = "individual"
                                }
                              [32m+[0m [0mtype            = "graph"
                              [32m+[0m [0mxaxis           = {
                                  [32m+[0m [0mmode   = "time"
                                  [32m+[0m [0mshow   = true
                                  [32m+[0m [0mvalues = []
                                }
                              [32m+[0m [0myaxes           = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mmin     = "0"
                                      [32m+[0m [0mshow    = true
                                    },
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mshow    = true
                                    },
                                ]
                              [32m+[0m [0myaxis           = {
                                  [32m+[0m [0malign = false
                                }
                            },
                          [32m+[0m [0m{
                              [32m+[0m [0maliasColors     = {}
                              [32m+[0m [0mbars            = false
                              [32m+[0m [0mdashLength      = 10
                              [32m+[0m [0mdashes          = false
                              [32m+[0m [0mdatasource      = {
                                  [32m+[0m [0muid = "$datasource"
                                }
                              [32m+[0m [0mfill            = 1
                              [32m+[0m [0mfillGradient    = 0
                              [32m+[0m [0mgridPos         = {
                                  [32m+[0m [0mh = 9
                                  [32m+[0m [0mw = 12
                                  [32m+[0m [0mx = 12
                                  [32m+[0m [0my = 39
                                }
                              [32m+[0m [0mhiddenSeries    = false
                              [32m+[0m [0mid              = 22
                              [32m+[0m [0mlegend          = {
                                  [32m+[0m [0malignAsTable = false
                                  [32m+[0m [0mavg          = false
                                  [32m+[0m [0mcurrent      = false
                                  [32m+[0m [0mmax          = false
                                  [32m+[0m [0mmin          = false
                                  [32m+[0m [0mrightSide    = true
                                  [32m+[0m [0mshow         = true
                                  [32m+[0m [0mtotal        = false
                                  [32m+[0m [0mvalues       = false
                                }
                              [32m+[0m [0mlines           = true
                              [32m+[0m [0mlinewidth       = 1
                              [32m+[0m [0mnullPointMode   = "null as zero"
                              [32m+[0m [0moptions         = {
                                  [32m+[0m [0mdataLinks = []
                                }
                              [32m+[0m [0mpercentage      = false
                              [32m+[0m [0mpointradius     = 2
                              [32m+[0m [0mpoints          = false
                              [32m+[0m [0mrenderer        = "flot"
                              [32m+[0m [0mseriesOverrides = []
                              [32m+[0m [0mspaceLength     = 10
                              [32m+[0m [0mstack           = false
                              [32m+[0m [0msteppedLine     = true
                              [32m+[0m [0mtargets         = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0malias            = "{{label}}"
                                      [32m+[0m [0mdimensions       = {
                                          [32m+[0m [0mInstanceId = "*"
                                        }
                                      [32m+[0m [0mexpression       = "REMOVE_EMPTY(SEARCH('{AWS/EC2,InstanceId} MetricName=\"DiskWriteBytes\"', 'Sum', $period))/$period"
                                      [32m+[0m [0mid               = ""
                                      [32m+[0m [0mmatchExact       = true
                                      [32m+[0m [0mmetricEditorMode = 1
                                      [32m+[0m [0mmetricName       = "DiskReadBytes"
                                      [32m+[0m [0mmetricQueryType  = 0
                                      [32m+[0m [0mnamespace        = "AWS/EC2"
                                      [32m+[0m [0mperiod           = "$period"
                                      [32m+[0m [0mrefId            = "A"
                                      [32m+[0m [0mregion           = "$region"
                                      [32m+[0m [0mstatistic        = "Sum"
                                    },
                                ]
                              [32m+[0m [0mthresholds      = []
                              [32m+[0m [0mtimeRegions     = []
                              [32m+[0m [0mtitle           = "Disk WRITE per instance [bytes/sec]"
                              [32m+[0m [0mtooltip         = {
                                  [32m+[0m [0mshared     = true
                                  [32m+[0m [0msort       = 0
                                  [32m+[0m [0mvalue_type = "individual"
                                }
                              [32m+[0m [0mtype            = "graph"
                              [32m+[0m [0mxaxis           = {
                                  [32m+[0m [0mmode   = "time"
                                  [32m+[0m [0mshow   = true
                                  [32m+[0m [0mvalues = []
                                }
                              [32m+[0m [0myaxes           = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mmin     = "0"
                                      [32m+[0m [0mshow    = true
                                    },
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mshow    = true
                                    },
                                ]
                              [32m+[0m [0myaxis           = {
                                  [32m+[0m [0malign = false
                                }
                            },
                          [32m+[0m [0m{
                              [32m+[0m [0maliasColors     = {}
                              [32m+[0m [0mbars            = false
                              [32m+[0m [0mdashLength      = 10
                              [32m+[0m [0mdashes          = false
                              [32m+[0m [0mdatasource      = {
                                  [32m+[0m [0muid = "$datasource"
                                }
                              [32m+[0m [0mfill            = 1
                              [32m+[0m [0mfillGradient    = 0
                              [32m+[0m [0mgridPos         = {
                                  [32m+[0m [0mh = 9
                                  [32m+[0m [0mw = 12
                                  [32m+[0m [0mx = 0
                                  [32m+[0m [0my = 48
                                }
                              [32m+[0m [0mhiddenSeries    = false
                              [32m+[0m [0mid              = 24
                              [32m+[0m [0mlegend          = {
                                  [32m+[0m [0malignAsTable = false
                                  [32m+[0m [0mavg          = false
                                  [32m+[0m [0mcurrent      = false
                                  [32m+[0m [0mmax          = false
                                  [32m+[0m [0mmin          = false
                                  [32m+[0m [0mrightSide    = true
                                  [32m+[0m [0mshow         = true
                                  [32m+[0m [0mtotal        = false
                                  [32m+[0m [0mvalues       = false
                                }
                              [32m+[0m [0mlines           = true
                              [32m+[0m [0mlinewidth       = 1
                              [32m+[0m [0mnullPointMode   = "null as zero"
                              [32m+[0m [0moptions         = {
                                  [32m+[0m [0mdataLinks = []
                                }
                              [32m+[0m [0mpercentage      = false
                              [32m+[0m [0mpointradius     = 2
                              [32m+[0m [0mpoints          = false
                              [32m+[0m [0mrenderer        = "flot"
                              [32m+[0m [0mseriesOverrides = []
                              [32m+[0m [0mspaceLength     = 10
                              [32m+[0m [0mstack           = false
                              [32m+[0m [0msteppedLine     = true
                              [32m+[0m [0mtargets         = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0malias            = "{{label}}"
                                      [32m+[0m [0mdimensions       = {
                                          [32m+[0m [0mInstanceId = "*"
                                        }
                                      [32m+[0m [0mexpression       = "REMOVE_EMPTY(SEARCH('{AWS/EC2,InstanceId} MetricName=\"DiskReadOps\"', 'Sum', $period))/$period"
                                      [32m+[0m [0mid               = ""
                                      [32m+[0m [0mmatchExact       = true
                                      [32m+[0m [0mmetricEditorMode = 1
                                      [32m+[0m [0mmetricName       = "DiskReadBytes"
                                      [32m+[0m [0mmetricQueryType  = 0
                                      [32m+[0m [0mnamespace        = "AWS/EC2"
                                      [32m+[0m [0mperiod           = "$period"
                                      [32m+[0m [0mrefId            = "A"
                                      [32m+[0m [0mregion           = "$region"
                                      [32m+[0m [0mstatistic        = "Sum"
                                    },
                                ]
                              [32m+[0m [0mthresholds      = []
                              [32m+[0m [0mtimeRegions     = []
                              [32m+[0m [0mtitle           = "Disk READ per instance [IOPS]"
                              [32m+[0m [0mtooltip         = {
                                  [32m+[0m [0mshared     = true
                                  [32m+[0m [0msort       = 0
                                  [32m+[0m [0mvalue_type = "individual"
                                }
                              [32m+[0m [0mtype            = "graph"
                              [32m+[0m [0mxaxis           = {
                                  [32m+[0m [0mmode   = "time"
                                  [32m+[0m [0mshow   = true
                                  [32m+[0m [0mvalues = []
                                }
                              [32m+[0m [0myaxes           = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mmin     = "0"
                                      [32m+[0m [0mshow    = true
                                    },
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mshow    = true
                                    },
                                ]
                              [32m+[0m [0myaxis           = {
                                  [32m+[0m [0malign = false
                                }
                            },
                          [32m+[0m [0m{
                              [32m+[0m [0maliasColors     = {}
                              [32m+[0m [0mbars            = false
                              [32m+[0m [0mdashLength      = 10
                              [32m+[0m [0mdashes          = false
                              [32m+[0m [0mdatasource      = {
                                  [32m+[0m [0muid = "$datasource"
                                }
                              [32m+[0m [0mdescription     = ""
                              [32m+[0m [0mfill            = 1
                              [32m+[0m [0mfillGradient    = 0
                              [32m+[0m [0mgridPos         = {
                                  [32m+[0m [0mh = 9
                                  [32m+[0m [0mw = 12
                                  [32m+[0m [0mx = 12
                                  [32m+[0m [0my = 48
                                }
                              [32m+[0m [0mhiddenSeries    = false
                              [32m+[0m [0mid              = 23
                              [32m+[0m [0mlegend          = {
                                  [32m+[0m [0malignAsTable = false
                                  [32m+[0m [0mavg          = false
                                  [32m+[0m [0mcurrent      = false
                                  [32m+[0m [0mmax          = false
                                  [32m+[0m [0mmin          = false
                                  [32m+[0m [0mrightSide    = true
                                  [32m+[0m [0mshow         = true
                                  [32m+[0m [0mtotal        = false
                                  [32m+[0m [0mvalues       = false
                                }
                              [32m+[0m [0mlines           = true
                              [32m+[0m [0mlinewidth       = 1
                              [32m+[0m [0mnullPointMode   = "null as zero"
                              [32m+[0m [0moptions         = {
                                  [32m+[0m [0mdataLinks = []
                                }
                              [32m+[0m [0mpercentage      = false
                              [32m+[0m [0mpointradius     = 2
                              [32m+[0m [0mpoints          = false
                              [32m+[0m [0mrenderer        = "flot"
                              [32m+[0m [0mseriesOverrides = []
                              [32m+[0m [0mspaceLength     = 10
                              [32m+[0m [0mstack           = false
                              [32m+[0m [0msteppedLine     = true
                              [32m+[0m [0mtargets         = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0malias            = "{{label}}"
                                      [32m+[0m [0mdimensions       = {
                                          [32m+[0m [0mInstanceId = "*"
                                        }
                                      [32m+[0m [0mexpression       = "REMOVE_EMPTY(SEARCH('{AWS/EC2,InstanceId} MetricName=\"DiskWriteOps\"', 'Sum', $period))/$period"
                                      [32m+[0m [0mid               = ""
                                      [32m+[0m [0mmatchExact       = true
                                      [32m+[0m [0mmetricEditorMode = 1
                                      [32m+[0m [0mmetricName       = "DiskReadBytes"
                                      [32m+[0m [0mmetricQueryType  = 0
                                      [32m+[0m [0mnamespace        = "AWS/EC2"
                                      [32m+[0m [0mperiod           = "$period"
                                      [32m+[0m [0mrefId            = "A"
                                      [32m+[0m [0mregion           = "$region"
                                      [32m+[0m [0mstatistic        = "Sum"
                                    },
                                ]
                              [32m+[0m [0mthresholds      = []
                              [32m+[0m [0mtimeRegions     = []
                              [32m+[0m [0mtitle           = "Disk WRITE per instance [IOPS]"
                              [32m+[0m [0mtooltip         = {
                                  [32m+[0m [0mshared     = true
                                  [32m+[0m [0msort       = 0
                                  [32m+[0m [0mvalue_type = "individual"
                                }
                              [32m+[0m [0mtype            = "graph"
                              [32m+[0m [0mxaxis           = {
                                  [32m+[0m [0mmode   = "time"
                                  [32m+[0m [0mshow   = true
                                  [32m+[0m [0mvalues = []
                                }
                              [32m+[0m [0myaxes           = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mmin     = "0"
                                      [32m+[0m [0mshow    = true
                                    },
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mshow    = true
                                    },
                                ]
                              [32m+[0m [0myaxis           = {
                                  [32m+[0m [0malign = false
                                }
                            },
                        ]
                      [32m+[0m [0mtitle      = "Disk details"
                      [32m+[0m [0mtype       = "row"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mcollapsed  = true
                      [32m+[0m [0mdatasource = {
                          [32m+[0m [0muid = "$datasource"
                        }
                      [32m+[0m [0mgridPos    = {
                          [32m+[0m [0mh = 1
                          [32m+[0m [0mw = 24
                          [32m+[0m [0mx = 0
                          [32m+[0m [0my = 20
                        }
                      [32m+[0m [0mpanels     = [
                          [32m+[0m [0m{
                              [32m+[0m [0maliasColors     = {}
                              [32m+[0m [0mbars            = false
                              [32m+[0m [0mdashLength      = 10
                              [32m+[0m [0mdashes          = false
                              [32m+[0m [0mdatasource      = {
                                  [32m+[0m [0muid = "$datasource"
                                }
                              [32m+[0m [0mdescription     = ""
                              [32m+[0m [0mfill            = 1
                              [32m+[0m [0mfillGradient    = 0
                              [32m+[0m [0mgridPos         = {
                                  [32m+[0m [0mh = 6
                                  [32m+[0m [0mw = 24
                                  [32m+[0m [0mx = 0
                                  [32m+[0m [0my = 58
                                }
                              [32m+[0m [0mhiddenSeries    = false
                              [32m+[0m [0mid              = 10
                              [32m+[0m [0mlegend          = {
                                  [32m+[0m [0malignAsTable = false
                                  [32m+[0m [0mavg          = false
                                  [32m+[0m [0mcurrent      = false
                                  [32m+[0m [0mmax          = false
                                  [32m+[0m [0mmin          = false
                                  [32m+[0m [0mrightSide    = true
                                  [32m+[0m [0mshow         = true
                                  [32m+[0m [0mtotal        = false
                                  [32m+[0m [0mvalues       = false
                                }
                              [32m+[0m [0mlines           = true
                              [32m+[0m [0mlinewidth       = 1
                              [32m+[0m [0mnullPointMode   = "connected"
                              [32m+[0m [0moptions         = {
                                  [32m+[0m [0mdataLinks = []
                                }
                              [32m+[0m [0mpercentage      = false
                              [32m+[0m [0mpointradius     = 2
                              [32m+[0m [0mpoints          = false
                              [32m+[0m [0mrenderer        = "flot"
                              [32m+[0m [0mseriesOverrides = []
                              [32m+[0m [0mspaceLength     = 10
                              [32m+[0m [0mstack           = false
                              [32m+[0m [0msteppedLine     = true
                              [32m+[0m [0mtargets         = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0malias            = ""
                                      [32m+[0m [0mdimensions       = {
                                          [32m+[0m [0mInstanceId = "*"
                                        }
                                      [32m+[0m [0mexpression       = ""
                                      [32m+[0m [0mid               = ""
                                      [32m+[0m [0mmatchExact       = true
                                      [32m+[0m [0mmetricEditorMode = 0
                                      [32m+[0m [0mmetricName       = "StatusCheckFailed"
                                      [32m+[0m [0mmetricQueryType  = 0
                                      [32m+[0m [0mnamespace        = "AWS/EC2"
                                      [32m+[0m [0mperiod           = "$period"
                                      [32m+[0m [0mrefId            = "A"
                                      [32m+[0m [0mregion           = "$region"
                                      [32m+[0m [0mstatistic        = "Sum"
                                    },
                                ]
                              [32m+[0m [0mthresholds      = []
                              [32m+[0m [0mtimeRegions     = []
                              [32m+[0m [0mtitle           = "Status check failed [Sum]"
                              [32m+[0m [0mtooltip         = {
                                  [32m+[0m [0mshared     = true
                                  [32m+[0m [0msort       = 0
                                  [32m+[0m [0mvalue_type = "individual"
                                }
                              [32m+[0m [0mtype            = "graph"
                              [32m+[0m [0mxaxis           = {
                                  [32m+[0m [0mmode   = "time"
                                  [32m+[0m [0mshow   = true
                                  [32m+[0m [0mvalues = []
                                }
                              [32m+[0m [0myaxes           = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mmin     = "0"
                                      [32m+[0m [0mshow    = true
                                    },
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mshow    = true
                                    },
                                ]
                              [32m+[0m [0myaxis           = {
                                  [32m+[0m [0malign = false
                                }
                            },
                          [32m+[0m [0m{
                              [32m+[0m [0maliasColors     = {}
                              [32m+[0m [0mbars            = false
                              [32m+[0m [0mdashLength      = 10
                              [32m+[0m [0mdashes          = false
                              [32m+[0m [0mdatasource      = {
                                  [32m+[0m [0muid = "$datasource"
                                }
                              [32m+[0m [0mdescription     = ""
                              [32m+[0m [0mfill            = 1
                              [32m+[0m [0mfillGradient    = 0
                              [32m+[0m [0mgridPos         = {
                                  [32m+[0m [0mh = 6
                                  [32m+[0m [0mw = 24
                                  [32m+[0m [0mx = 0
                                  [32m+[0m [0my = 64
                                }
                              [32m+[0m [0mhiddenSeries    = false
                              [32m+[0m [0mid              = 27
                              [32m+[0m [0mlegend          = {
                                  [32m+[0m [0malignAsTable = false
                                  [32m+[0m [0mavg          = false
                                  [32m+[0m [0mcurrent      = false
                                  [32m+[0m [0mmax          = false
                                  [32m+[0m [0mmin          = false
                                  [32m+[0m [0mrightSide    = true
                                  [32m+[0m [0mshow         = true
                                  [32m+[0m [0mtotal        = false
                                  [32m+[0m [0mvalues       = false
                                }
                              [32m+[0m [0mlines           = true
                              [32m+[0m [0mlinewidth       = 1
                              [32m+[0m [0mnullPointMode   = "connected"
                              [32m+[0m [0moptions         = {
                                  [32m+[0m [0mdataLinks = []
                                }
                              [32m+[0m [0mpercentage      = false
                              [32m+[0m [0mpointradius     = 2
                              [32m+[0m [0mpoints          = false
                              [32m+[0m [0mrenderer        = "flot"
                              [32m+[0m [0mseriesOverrides = []
                              [32m+[0m [0mspaceLength     = 10
                              [32m+[0m [0mstack           = false
                              [32m+[0m [0msteppedLine     = true
                              [32m+[0m [0mtargets         = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0malias            = ""
                                      [32m+[0m [0mdimensions       = {
                                          [32m+[0m [0mInstanceId = "*"
                                        }
                                      [32m+[0m [0mexpression       = ""
                                      [32m+[0m [0mid               = ""
                                      [32m+[0m [0mmatchExact       = true
                                      [32m+[0m [0mmetricEditorMode = 0
                                      [32m+[0m [0mmetricName       = "StatusCheckFailed"
                                      [32m+[0m [0mmetricQueryType  = 0
                                      [32m+[0m [0mnamespace        = "AWS/EC2"
                                      [32m+[0m [0mperiod           = "$period"
                                      [32m+[0m [0mrefId            = "A"
                                      [32m+[0m [0mregion           = "$region"
                                      [32m+[0m [0mstatistic        = "Sum"
                                    },
                                ]
                              [32m+[0m [0mthresholds      = []
                              [32m+[0m [0mtimeRegions     = []
                              [32m+[0m [0mtitle           = "Instance status check failed [Sum]"
                              [32m+[0m [0mtooltip         = {
                                  [32m+[0m [0mshared     = true
                                  [32m+[0m [0msort       = 0
                                  [32m+[0m [0mvalue_type = "individual"
                                }
                              [32m+[0m [0mtype            = "graph"
                              [32m+[0m [0mxaxis           = {
                                  [32m+[0m [0mmode   = "time"
                                  [32m+[0m [0mshow   = true
                                  [32m+[0m [0mvalues = []
                                }
                              [32m+[0m [0myaxes           = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mmin     = "0"
                                      [32m+[0m [0mshow    = true
                                    },
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mshow    = true
                                    },
                                ]
                              [32m+[0m [0myaxis           = {
                                  [32m+[0m [0malign = false
                                }
                            },
                          [32m+[0m [0m{
                              [32m+[0m [0maliasColors     = {}
                              [32m+[0m [0mbars            = false
                              [32m+[0m [0mdashLength      = 10
                              [32m+[0m [0mdashes          = false
                              [32m+[0m [0mdatasource      = {
                                  [32m+[0m [0muid = "$datasource"
                                }
                              [32m+[0m [0mdescription     = ""
                              [32m+[0m [0mfill            = 1
                              [32m+[0m [0mfillGradient    = 0
                              [32m+[0m [0mgridPos         = {
                                  [32m+[0m [0mh = 6
                                  [32m+[0m [0mw = 24
                                  [32m+[0m [0mx = 0
                                  [32m+[0m [0my = 70
                                }
                              [32m+[0m [0mhiddenSeries    = false
                              [32m+[0m [0mid              = 28
                              [32m+[0m [0mlegend          = {
                                  [32m+[0m [0malignAsTable = false
                                  [32m+[0m [0mavg          = false
                                  [32m+[0m [0mcurrent      = false
                                  [32m+[0m [0mmax          = false
                                  [32m+[0m [0mmin          = false
                                  [32m+[0m [0mrightSide    = true
                                  [32m+[0m [0mshow         = true
                                  [32m+[0m [0mtotal        = false
                                  [32m+[0m [0mvalues       = false
                                }
                              [32m+[0m [0mlines           = true
                              [32m+[0m [0mlinewidth       = 1
                              [32m+[0m [0mnullPointMode   = "connected"
                              [32m+[0m [0moptions         = {
                                  [32m+[0m [0mdataLinks = []
                                }
                              [32m+[0m [0mpercentage      = false
                              [32m+[0m [0mpointradius     = 2
                              [32m+[0m [0mpoints          = false
                              [32m+[0m [0mrenderer        = "flot"
                              [32m+[0m [0mseriesOverrides = []
                              [32m+[0m [0mspaceLength     = 10
                              [32m+[0m [0mstack           = false
                              [32m+[0m [0msteppedLine     = true
                              [32m+[0m [0mtargets         = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0malias            = ""
                                      [32m+[0m [0mdimensions       = {
                                          [32m+[0m [0mInstanceId = "*"
                                        }
                                      [32m+[0m [0mexpression       = ""
                                      [32m+[0m [0mid               = ""
                                      [32m+[0m [0mmatchExact       = true
                                      [32m+[0m [0mmetricEditorMode = 0
                                      [32m+[0m [0mmetricName       = "StatusCheckFailed"
                                      [32m+[0m [0mmetricQueryType  = 0
                                      [32m+[0m [0mnamespace        = "AWS/EC2"
                                      [32m+[0m [0mperiod           = "$period"
                                      [32m+[0m [0mrefId            = "A"
                                      [32m+[0m [0mregion           = "$region"
                                      [32m+[0m [0mstatistic        = "Sum"
                                    },
                                ]
                              [32m+[0m [0mthresholds      = []
                              [32m+[0m [0mtimeRegions     = []
                              [32m+[0m [0mtitle           = "System status check failed [Sum]"
                              [32m+[0m [0mtooltip         = {
                                  [32m+[0m [0mshared     = true
                                  [32m+[0m [0msort       = 0
                                  [32m+[0m [0mvalue_type = "individual"
                                }
                              [32m+[0m [0mtype            = "graph"
                              [32m+[0m [0mxaxis           = {
                                  [32m+[0m [0mmode   = "time"
                                  [32m+[0m [0mshow   = true
                                  [32m+[0m [0mvalues = []
                                }
                              [32m+[0m [0myaxes           = [
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mmin     = "0"
                                      [32m+[0m [0mshow    = true
                                    },
                                  [32m+[0m [0m{
                                      [32m+[0m [0mformat  = "short"
                                      [32m+[0m [0mlogBase = 1
                                      [32m+[0m [0mshow    = true
                                    },
                                ]
                              [32m+[0m [0myaxis           = {
                                  [32m+[0m [0malign = false
                                }
                            },
                        ]
                      [32m+[0m [0mtitle      = "Status Checks"
                      [32m+[0m [0mtype       = "row"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mcollapsed  = false
                      [32m+[0m [0mdatasource = {
                          [32m+[0m [0muid = "$datasource"
                        }
                      [32m+[0m [0mgridPos    = {
                          [32m+[0m [0mh = 1
                          [32m+[0m [0mw = 24
                          [32m+[0m [0mx = 0
                          [32m+[0m [0my = 21
                        }
                      [32m+[0m [0mpanels     = []
                      [32m+[0m [0mtitle      = "Information"
                      [32m+[0m [0mtype       = "row"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mdatasource    = {
                          [32m+[0m [0muid = "$datasource"
                        }
                      [32m+[0m [0mgridPos       = {
                          [32m+[0m [0mh = 4
                          [32m+[0m [0mw = 24
                          [32m+[0m [0mx = 0
                          [32m+[0m [0my = 22
                        }
                      [32m+[0m [0moptions       = {
                          [32m+[0m [0mcontent = <<-EOT
                                For more information about avaialble metrics from Amazon EC2, visit the [List of Available CloudWatch Metrics for Your EC2 Instances](https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/viewing_metrics_with_cloudwatch.html) in the Amazon documentation.
                                
                                For additional metrics and 1-minute granularity, enable [Detailed Monitoring](https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/using-cloudwatch-new.html) for your Amazon EC2 instances.
                                
                                This dashboard has been optimized for 1-minute metrics.
                            EOT
                          [32m+[0m [0mmode    = "markdown"
                        }
                      [32m+[0m [0mpluginVersion = "9.0.1-b253e87pre"
                      [32m+[0m [0mtargets       = [
                          [32m+[0m [0m{
                              [32m+[0m [0malias            = ""
                              [32m+[0m [0mdimensions       = {}
                              [32m+[0m [0mexpression       = ""
                              [32m+[0m [0mid               = ""
                              [32m+[0m [0mmatchExact       = true
                              [32m+[0m [0mmetricEditorMode = 0
                              [32m+[0m [0mmetricName       = ""
                              [32m+[0m [0mmetricQueryType  = 0
                              [32m+[0m [0mnamespace        = ""
                              [32m+[0m [0mrefId            = "A"
                              [32m+[0m [0mregion           = "default"
                              [32m+[0m [0mstatistic        = "Average"
                            },
                        ]
                      [32m+[0m [0mtitle         = " "
                      [32m+[0m [0mtype          = "text"
                    },
                ]
              [32m+[0m [0mrefresh              = false
              [32m+[0m [0mschemaVersion        = 36
              [32m+[0m [0mstyle                = "dark"
              [32m+[0m [0mtags                 = [
                  [32m+[0m [0m"Amazon",
                  [32m+[0m [0m"AWS",
                  [32m+[0m [0m"CloudWatch",
                  [32m+[0m [0m"EC2",
                ]
              [32m+[0m [0mtemplating           = {
                  [32m+[0m [0mlist = [
                      [32m+[0m [0m{
                          [32m+[0m [0mcurrent     = {
                              [32m+[0m [0mselected = false
                              [32m+[0m [0mtext     = "CloudWatch"
                              [32m+[0m [0mvalue    = "CloudWatch"
                            }
                          [32m+[0m [0mhide        = 0
                          [32m+[0m [0mincludeAll  = false
                          [32m+[0m [0mlabel       = "Data source"
                          [32m+[0m [0mmulti       = false
                          [32m+[0m [0mname        = "datasource"
                          [32m+[0m [0moptions     = []
                          [32m+[0m [0mquery       = "cloudwatch"
                          [32m+[0m [0mrefresh     = 1
                          [32m+[0m [0mregex       = ""
                          [32m+[0m [0mskipUrlSync = false
                          [32m+[0m [0mtype        = "datasource"
                        },
                      [32m+[0m [0m{
                          [32m+[0m [0mcurrent        = {
                              [32m+[0m [0mselected = false
                              [32m+[0m [0mtext     = "default"
                              [32m+[0m [0mvalue    = "default"
                            }
                          [32m+[0m [0mdatasource     = {
                              [32m+[0m [0mtype = "prometheus"
                              [32m+[0m [0muid  = "$datasource"
                            }
                          [32m+[0m [0mdefinition     = "regions()"
                          [32m+[0m [0mhide           = 0
                          [32m+[0m [0mincludeAll     = false
                          [32m+[0m [0mlabel          = "Region"
                          [32m+[0m [0mmulti          = false
                          [32m+[0m [0mname           = "region"
                          [32m+[0m [0moptions        = []
                          [32m+[0m [0mquery          = "regions()"
                          [32m+[0m [0mrefresh        = 1
                          [32m+[0m [0mregex          = ""
                          [32m+[0m [0mskipUrlSync    = false
                          [32m+[0m [0msort           = 0
                          [32m+[0m [0mtagValuesQuery = ""
                          [32m+[0m [0mtagsQuery      = ""
                          [32m+[0m [0mtype           = "query"
                          [32m+[0m [0museTags        = false
                        },
                      [32m+[0m [0m{
                          [32m+[0m [0mcurrent     = {
                              [32m+[0m [0mselected = true
                              [32m+[0m [0mtags     = []
                              [32m+[0m [0mtext     = "300"
                              [32m+[0m [0mvalue    = "300"
                            }
                          [32m+[0m [0mhide        = 0
                          [32m+[0m [0mincludeAll  = false
                          [32m+[0m [0mlabel       = "Period [sec]"
                          [32m+[0m [0mmulti       = false
                          [32m+[0m [0mname        = "period"
                          [32m+[0m [0moptions     = [
                              [32m+[0m [0m{
                                  [32m+[0m [0mselected = false
                                  [32m+[0m [0mtext     = "60"
                                  [32m+[0m [0mvalue    = "60"
                                },
                              [32m+[0m [0m{
                                  [32m+[0m [0mselected = true
                                  [32m+[0m [0mtext     = "300"
                                  [32m+[0m [0mvalue    = "300"
                                },
                              [32m+[0m [0m{
                                  [32m+[0m [0mselected = false
                                  [32m+[0m [0mtext     = "3600"
                                  [32m+[0m [0mvalue    = "3600"
                                },
                            ]
                          [32m+[0m [0mquery       = "60,300,3600"
                          [32m+[0m [0mskipUrlSync = false
                          [32m+[0m [0mtype        = "custom"
                        },
                    ]
                }
              [32m+[0m [0mtime                 = {
                  [32m+[0m [0mfrom = "now-6h"
                  [32m+[0m [0mto   = "now"
                }
              [32m+[0m [0mtimepicker           = {
                  [32m+[0m [0mrefresh_intervals = [
                      [32m+[0m [0m"5s",
                      [32m+[0m [0m"10s",
                      [32m+[0m [0m"30s",
                      [32m+[0m [0m"1m",
                      [32m+[0m [0m"5m",
                      [32m+[0m [0m"15m",
                      [32m+[0m [0m"30m",
                      [32m+[0m [0m"1h",
                      [32m+[0m [0m"2h",
                      [32m+[0m [0m"1d",
                    ]
                }
              [32m+[0m [0mtimezone             = ""
              [32m+[0m [0mtitle                = "Amazon EC2"
              [32m+[0m [0muid                  = "tmsOtSxZk"
              [32m+[0m [0mweekStart            = ""
            }
        )
      [32m+[0m [0m[1m[0mdashboard_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mfolder[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mslug[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0muid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0murl[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mversion[0m[0m      = (known after apply)
    }

[1m  # grafana_dashboard.influxdb["sample-dashboard.json"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "grafana_dashboard" "influxdb" {
      [32m+[0m [0m[1m[0mconfig_json[0m[0m  = jsonencode(
            {
              [32m+[0m [0mannotations          = {
                  [32m+[0m [0mlist = [
                      [32m+[0m [0m{
                          [32m+[0m [0mbuiltIn    = 1
                          [32m+[0m [0mdatasource = {
                              [32m+[0m [0mtype = "grafana"
                              [32m+[0m [0muid  = "-- Grafana --"
                            }
                          [32m+[0m [0menable     = true
                          [32m+[0m [0mhide       = true
                          [32m+[0m [0miconColor  = "rgba(0, 211, 255, 1)"
                          [32m+[0m [0mname       = "Annotations & Alerts"
                          [32m+[0m [0mtarget     = {
                              [32m+[0m [0mlimit    = 100
                              [32m+[0m [0mmatchAny = false
                              [32m+[0m [0mtags     = []
                              [32m+[0m [0mtype     = "dashboard"
                            }
                          [32m+[0m [0mtype       = "dashboard"
                        },
                    ]
                }
              [32m+[0m [0meditable             = true
              [32m+[0m [0mfiscalYearStartMonth = 0
              [32m+[0m [0mgraphTooltip         = 0
              [32m+[0m [0mlinks                = []
              [32m+[0m [0mliveNow              = false
              [32m+[0m [0mpanels               = [
                  [32m+[0m [0m{
                      [32m+[0m [0mdatasource  = {
                          [32m+[0m [0mtype = "influxdb"
                          [32m+[0m [0muid  = "xLNPLcX7z"
                        }
                      [32m+[0m [0mdescription = "Air sensor sample data from InfluxDB https://docs.influxdata.com/influxdb/cloud/reference/sample-data/#air-sensor-sample-data"
                      [32m+[0m [0mfieldConfig = {
                          [32m+[0m [0mdefaults  = {
                              [32m+[0m [0mcolor      = {
                                  [32m+[0m [0mmode = "palette-classic"
                                }
                              [32m+[0m [0mcustom     = {
                                  [32m+[0m [0maxisLabel         = ""
                                  [32m+[0m [0maxisPlacement     = "auto"
                                  [32m+[0m [0mbarAlignment      = 0
                                  [32m+[0m [0mdrawStyle         = "line"
                                  [32m+[0m [0mfillOpacity       = 0
                                  [32m+[0m [0mgradientMode      = "none"
                                  [32m+[0m [0mhideFrom          = {
                                      [32m+[0m [0mlegend  = false
                                      [32m+[0m [0mtooltip = false
                                      [32m+[0m [0mviz     = false
                                    }
                                  [32m+[0m [0mlineInterpolation = "linear"
                                  [32m+[0m [0mlineStyle         = {
                                      [32m+[0m [0mfill = "solid"
                                    }
                                  [32m+[0m [0mlineWidth         = 1
                                  [32m+[0m [0mpointSize         = 5
                                  [32m+[0m [0mscaleDistribution = {
                                      [32m+[0m [0mtype = "linear"
                                    }
                                  [32m+[0m [0mshowPoints        = "auto"
                                  [32m+[0m [0mspanNulls         = false
                                  [32m+[0m [0mstacking          = {
                                      [32m+[0m [0mgroup = "A"
                                      [32m+[0m [0mmode  = "none"
                                    }
                                  [32m+[0m [0mthresholdsStyle   = {
                                      [32m+[0m [0mmode = "off"
                                    }
                                }
                              [32m+[0m [0mmappings   = []
                              [32m+[0m [0mthresholds = {
                                  [32m+[0m [0mmode  = "absolute"
                                  [32m+[0m [0msteps = [
                                      [32m+[0m [0m{
                                          [32m+[0m [0mcolor = "green"
                                          [32m+[0m [0mvalue = [90mnull[0m[0m
                                        },
                                      [32m+[0m [0m{
                                          [32m+[0m [0mcolor = "red"
                                          [32m+[0m [0mvalue = 80
                                        },
                                    ]
                                }
                            }
                          [32m+[0m [0moverrides = [
                              [32m+[0m [0m{
                                  [32m+[0m [0m__systemRef = "hideSeriesFrom"
                                  [32m+[0m [0mmatcher     = {
                                      [32m+[0m [0mid      = "byNames"
                                      [32m+[0m [0moptions = {
                                          [32m+[0m [0mmode     = "exclude"
                                          [32m+[0m [0mnames    = [
                                              [32m+[0m [0m"co TLM0102",
                                            ]
                                          [32m+[0m [0mprefix   = "All except:"
                                          [32m+[0m [0mreadOnly = true
                                        }
                                    }
                                  [32m+[0m [0mproperties  = [
                                      [32m+[0m [0m{
                                          [32m+[0m [0mid    = "custom.hideFrom"
                                          [32m+[0m [0mvalue = {
                                              [32m+[0m [0mlegend  = false
                                              [32m+[0m [0mtooltip = false
                                              [32m+[0m [0mviz     = true
                                            }
                                        },
                                    ]
                                },
                            ]
                        }
                      [32m+[0m [0mgridPos     = {
                          [32m+[0m [0mh = 17
                          [32m+[0m [0mw = 24
                          [32m+[0m [0mx = 0
                          [32m+[0m [0my = 0
                        }
                      [32m+[0m [0moptions     = {
                          [32m+[0m [0mlegend  = {
                              [32m+[0m [0mcalcs       = []
                              [32m+[0m [0mdisplayMode = "list"
                              [32m+[0m [0mplacement   = "bottom"
                            }
                          [32m+[0m [0mtooltip = {
                              [32m+[0m [0mmode = "single"
                              [32m+[0m [0msort = "none"
                            }
                        }
                      [32m+[0m [0mtargets     = [
                          [32m+[0m [0m{
                              [32m+[0m [0mdatasource = {
                                  [32m+[0m [0mtype = "influxdb"
                                  [32m+[0m [0muid  = "xLNPLcX7z"
                                }
                              [32m+[0m [0mquery      = <<-EOT
                                    import "influxdata/influxdb/sample"
                                    sample.data(set: "airSensor")
                                    	|> range(start: v.timeRangeStart, stop: v.timeRangeStop)
                                      |> filter(fn: (r) => r["_measurement"] == "airSensors")
                                      |> filter(fn: (r) => r["_field"] == "temperature" or r["_field"] == "humidity" or r["_field"] == "co")
                                EOT
                              [32m+[0m [0mrefId      = "A"
                            },
                        ]
                      [32m+[0m [0mtitle       = "Air Sensors"
                      [32m+[0m [0mtype        = "timeseries"
                    },
                ]
              [32m+[0m [0mrefresh              = false
              [32m+[0m [0mschemaVersion        = 36
              [32m+[0m [0mstyle                = "dark"
              [32m+[0m [0mtags                 = []
              [32m+[0m [0mtemplating           = {
                  [32m+[0m [0mlist = []
                }
              [32m+[0m [0mtime                 = {
                  [32m+[0m [0mfrom = "2022-06-21T17:05:46.978Z"
                  [32m+[0m [0mto   = "2022-06-21T17:53:35.857Z"
                }
              [32m+[0m [0mtimepicker           = {}
              [32m+[0m [0mtimezone             = ""
              [32m+[0m [0mtitle                = "InfluxDB Cloud Demos"
              [32m+[0m [0muid                  = "9uim8cunk"
              [32m+[0m [0mweekStart            = ""
            }
        )
      [32m+[0m [0m[1m[0mdashboard_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mfolder[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mslug[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0muid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0murl[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mversion[0m[0m      = (known after apply)
    }

[1m  # grafana_dashboard.influxdb["yo-dashboard.json"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "grafana_dashboard" "influxdb" {
      [32m+[0m [0m[1m[0mconfig_json[0m[0m  = jsonencode(
            {
              [32m+[0m [0mannotations          = {
                  [32m+[0m [0mlist = [
                      [32m+[0m [0m{
                          [32m+[0m [0mbuiltIn    = 1
                          [32m+[0m [0mdatasource = {
                              [32m+[0m [0mtype = "grafana"
                              [32m+[0m [0muid  = "-- Grafana --"
                            }
                          [32m+[0m [0menable     = true
                          [32m+[0m [0mhide       = true
                          [32m+[0m [0miconColor  = "rgba(0, 211, 255, 1)"
                          [32m+[0m [0mname       = "Annotations & Alerts"
                          [32m+[0m [0mtarget     = {
                              [32m+[0m [0mlimit    = 100
                              [32m+[0m [0mmatchAny = false
                              [32m+[0m [0mtags     = []
                              [32m+[0m [0mtype     = "dashboard"
                            }
                          [32m+[0m [0mtype       = "dashboard"
                        },
                    ]
                }
              [32m+[0m [0meditable             = true
              [32m+[0m [0mfiscalYearStartMonth = 0
              [32m+[0m [0mgraphTooltip         = 0
              [32m+[0m [0mlinks                = []
              [32m+[0m [0mliveNow              = false
              [32m+[0m [0mpanels               = [
                  [32m+[0m [0m{
                      [32m+[0m [0mdatasource  = {
                          [32m+[0m [0mtype = "influxdb"
                          [32m+[0m [0muid  = "xLNPLcX7z"
                        }
                      [32m+[0m [0mdescription = "Air sensor sample data from InfluxDB https://docs.influxdata.com/influxdb/cloud/reference/sample-data/#air-sensor-sample-data"
                      [32m+[0m [0mfieldConfig = {
                          [32m+[0m [0mdefaults  = {
                              [32m+[0m [0mcolor      = {
                                  [32m+[0m [0mmode = "palette-classic"
                                }
                              [32m+[0m [0mcustom     = {
                                  [32m+[0m [0maxisLabel         = ""
                                  [32m+[0m [0maxisPlacement     = "auto"
                                  [32m+[0m [0mbarAlignment      = 0
                                  [32m+[0m [0mdrawStyle         = "line"
                                  [32m+[0m [0mfillOpacity       = 0
                                  [32m+[0m [0mgradientMode      = "none"
                                  [32m+[0m [0mhideFrom          = {
                                      [32m+[0m [0mlegend  = false
                                      [32m+[0m [0mtooltip = false
                                      [32m+[0m [0mviz     = false
                                    }
                                  [32m+[0m [0mlineInterpolation = "linear"
                                  [32m+[0m [0mlineStyle         = {
                                      [32m+[0m [0mfill = "solid"
                                    }
                                  [32m+[0m [0mlineWidth         = 1
                                  [32m+[0m [0mpointSize         = 5
                                  [32m+[0m [0mscaleDistribution = {
                                      [32m+[0m [0mtype = "linear"
                                    }
                                  [32m+[0m [0mshowPoints        = "auto"
                                  [32m+[0m [0mspanNulls         = false
                                  [32m+[0m [0mstacking          = {
                                      [32m+[0m [0mgroup = "A"
                                      [32m+[0m [0mmode  = "none"
                                    }
                                  [32m+[0m [0mthresholdsStyle   = {
                                      [32m+[0m [0mmode = "off"
                                    }
                                }
                              [32m+[0m [0mmappings   = []
                              [32m+[0m [0mthresholds = {
                                  [32m+[0m [0mmode  = "absolute"
                                  [32m+[0m [0msteps = [
                                      [32m+[0m [0m{
                                          [32m+[0m [0mcolor = "green"
                                          [32m+[0m [0mvalue = [90mnull[0m[0m
                                        },
                                      [32m+[0m [0m{
                                          [32m+[0m [0mcolor = "red"
                                          [32m+[0m [0mvalue = 80
                                        },
                                    ]
                                }
                            }
                          [32m+[0m [0moverrides = [
                              [32m+[0m [0m{
                                  [32m+[0m [0m__systemRef = "hideSeriesFrom"
                                  [32m+[0m [0mmatcher     = {
                                      [32m+[0m [0mid      = "byNames"
                                      [32m+[0m [0moptions = {
                                          [32m+[0m [0mmode     = "exclude"
                                          [32m+[0m [0mnames    = [
                                              [32m+[0m [0m"co TLM0102",
                                            ]
                                          [32m+[0m [0mprefix   = "All except:"
                                          [32m+[0m [0mreadOnly = true
                                        }
                                    }
                                  [32m+[0m [0mproperties  = [
                                      [32m+[0m [0m{
                                          [32m+[0m [0mid    = "custom.hideFrom"
                                          [32m+[0m [0mvalue = {
                                              [32m+[0m [0mlegend  = false
                                              [32m+[0m [0mtooltip = false
                                              [32m+[0m [0mviz     = true
                                            }
                                        },
                                    ]
                                },
                            ]
                        }
                      [32m+[0m [0mgridPos     = {
                          [32m+[0m [0mh = 17
                          [32m+[0m [0mw = 24
                          [32m+[0m [0mx = 0
                          [32m+[0m [0my = 0
                        }
                      [32m+[0m [0moptions     = {
                          [32m+[0m [0mlegend  = {
                              [32m+[0m [0mcalcs       = []
                              [32m+[0m [0mdisplayMode = "list"
                              [32m+[0m [0mplacement   = "bottom"
                            }
                          [32m+[0m [0mtooltip = {
                              [32m+[0m [0mmode = "single"
                              [32m+[0m [0msort = "none"
                            }
                        }
                      [32m+[0m [0mtargets     = [
                          [32m+[0m [0m{
                              [32m+[0m [0mdatasource = {
                                  [32m+[0m [0mtype = "influxdb"
                                  [32m+[0m [0muid  = "xLNPLcX7z"
                                }
                              [32m+[0m [0mquery      = <<-EOT
                                    import "influxdata/influxdb/sample"
                                    sample.data(set: "airSensor")
                                    	|> range(start: v.timeRangeStart, stop: v.timeRangeStop)
                                      |> filter(fn: (r) => r["_measurement"] == "airSensors")
                                      |> filter(fn: (r) => r["_field"] == "temperature" or r["_field"] == "humidity" or r["_field"] == "co")
                                EOT
                              [32m+[0m [0mrefId      = "A"
                            },
                        ]
                      [32m+[0m [0mtitle       = "Air Sensors"
                      [32m+[0m [0mtype        = "timeseries"
                    },
                ]
              [32m+[0m [0mrefresh              = false
              [32m+[0m [0mschemaVersion        = 36
              [32m+[0m [0mstyle                = "dark"
              [32m+[0m [0mtags                 = []
              [32m+[0m [0mtemplating           = {
                  [32m+[0m [0mlist = []
                }
              [32m+[0m [0mtime                 = {
                  [32m+[0m [0mfrom = "2022-06-21T17:05:46.978Z"
                  [32m+[0m [0mto   = "2022-06-21T17:53:35.857Z"
                }
              [32m+[0m [0mtimepicker           = {}
              [32m+[0m [0mtimezone             = ""
              [32m+[0m [0mtitle                = "YOLO Cloud Demos"
              [32m+[0m [0muid                  = "9uimasdas"
              [32m+[0m [0mweekStart            = ""
            }
        )
      [32m+[0m [0m[1m[0mdashboard_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mfolder[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mslug[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0muid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0murl[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mversion[0m[0m      = (known after apply)
    }

[1m  # grafana_data_source.influxdb[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "grafana_data_source" "influxdb" {
      [32m+[0m [0m[1m[0maccess_mode[0m[0m        = "proxy"
      [32m+[0m [0m[1m[0mbasic_auth_enabled[0m[0m = false
      [32m+[0m [0m[1m[0mdatabase_name[0m[0m      = "test"
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mis_default[0m[0m         = false
      [32m+[0m [0m[1m[0mname[0m[0m               = "influxdb"
      [32m+[0m [0m[1m[0mpassword[0m[0m           = (sensitive value)
      [32m+[0m [0m[1m[0mtype[0m[0m               = "influxdb"
      [32m+[0m [0m[1m[0muid[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0murl[0m[0m                = "https://influxdb.test.com"
      [32m+[0m [0m[1m[0musername[0m[0m           = "username"
    }

[1m  # grafana_folder.Demos[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "grafana_folder" "Demos" {
      [32m+[0m [0m[1m[0mid[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mtitle[0m[0m = "Demos"
      [32m+[0m [0m[1m[0muid[0m[0m   = "12345"
      [32m+[0m [0m[1m[0murl[0m[0m   = (known after apply)
    }

[0m[1mPlan:[0m 7 to add, 0 to change, 0 to destroy.
[0m[0m[1mgrafana_cloud_stack.ishanterraformde: Creating...[0m[0m
[0m[1mgrafana_cloud_stack.ishanterraformde: Still creating... [10s elapsed][0m[0m
[0m[1mgrafana_cloud_stack.ishanterraformde: Still creating... [20s elapsed][0m[0m
[0m[1mgrafana_cloud_stack.ishanterraformde: Still creating... [30s elapsed][0m[0m
[0m[1mgrafana_cloud_stack.ishanterraformde: Still creating... [40s elapsed][0m[0m
[0m[1mgrafana_cloud_stack.ishanterraformde: Still creating... [50s elapsed][0m[0m
[0m[1mgrafana_cloud_stack.ishanterraformde: Creation complete after 51s [id=388071][0m
[0m[1mgrafana_api_key.terraform: Creating...[0m[0m
[0m[1mgrafana_api_key.terraform: Creation complete after 2s [id=2][0m
[0m[1mgrafana_data_source.influxdb: Creating...[0m[0m
[0m[1mgrafana_folder.Demos: Creating...[0m[0m
[0m[1mgrafana_data_source.influxdb: Creation complete after 0s [id=18][0m
[0m[1mgrafana_folder.Demos: Creation complete after 0s [id=10][0m
[0m[1mgrafana_dashboard.influxdb["sample-dashboard.json"]: Creating...[0m[0m
[0m[1mgrafana_dashboard.influxdb["yo-dashboard.json"]: Creating...[0m[0m
[0m[1mgrafana_dashboard.influxdb["new-dashboard.json"]: Creating...[0m[0m
[0m[1mgrafana_dashboard.influxdb["yo-dashboard.json"]: Creation complete after 0s [id=9uimasdas][0m
[0m[1mgrafana_dashboard.influxdb["sample-dashboard.json"]: Creation complete after 0s [id=9uim8cunk][0m
[0m[1mgrafana_dashboard.influxdb["new-dashboard.json"]: Creation complete after 0s [id=tmsOtSxZk][0m
[0m[1m[32m
Apply complete! Resources: 7 added, 0 changed, 0 destroyed.
[0m
```